Tekla.Structures.ModelInternal.Geometry.Rotation3D
Represents 3d rotation of object.

Tekla.Structures.ModelInternal.Geometry.Rotation3D.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.Geometry.Rotation3D class.

Tekla.Structures.ModelInternal.Geometry.Rotation3D.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Initializes a new instance of the Tekla.Structures.ModelInternal.Geometry.Rotation3D class.
axisX: The X direction, must be unit.
axisY: The Y direction, must be unit and perpendicular to axisX.

Tekla.Structures.ModelInternal.Geometry.Rotation3D.#ctor(System.Tuple{System.Tuple{System.Double,System.Double,System.Double},System.Tuple{System.Double,System.Double,System.Double}})
Initializes a new instance of the Tekla.Structures.ModelInternal.Geometry.Rotation3D class.
rotationData: The rotation data, encoded as tuples.

Tekla.Structures.ModelInternal.Geometry.Rotation3D.AxisX
Gets the X direction.

Tekla.Structures.ModelInternal.Geometry.Rotation3D.AxisY
Gets the Y direction.

Tekla.Structures.ModelInternal.Geometry.Rotation3D.AxisZ
Gets the Z direction.

Tekla.Structures.ModelInternal.Geometry.Rotation3D.AsData
Gets data encoded as tuples.

Tekla.Structures.ModelInternal.Geometry.Rotation3D.FromZRotation(System.Double)
Creates Tekla.Structures.ModelInternal.Geometry.Rotation3D which represents rotation around the Z axis.
angle: The rotation andle, in radians.